export let Configuration = {
  landsLayerUrl: 'https://services9.arcgis.com/7cs4rq15YlksXBMf/arcgis/rest/services/Hossam_Web_App/FeatureServer/0',
  CA: {
    productName: "CA",
    Details: `منطقة تجارية
    أمثلة: مراكز التسوق ، البيع بالجملة ، ورش العمل
    تتطلب المناطق التجارية تنوعاً كبيراً في أنواع اللوحات، كل الواجهات التي تطل على الفراغات العامة والطرق يحكمها
    قواعد خاصة وفق نوع اللوحة، وبشكل عام فإنه يجب ألا يتعارض التصميم مع طابع اللوحات المجاورة، لذلك عادة ما
    يكون الطابع السائد "النمط السائد" هو المقبول ضمن هذه المناطق.`,
    SignageTypes: ["لوحة محل", "لوحة المبنى", "لوحة مظلة منفصلة", "لوحة أسفل مظلة", "لوحة نافذة محل", "لوحة مظلة قابلة للطي", "لوحة عمودية جانبية"],
    ProductTypes: ["لوحة مسطحة", "الحروف ثلاثية الابعاد", "صناديق الإضاءة"],
    LightingTypes: ["اضاءة امامية", "اضاءة خلفية", "اضاءة جانبية", "اضاءة خارجية"],
    LightingLevels: ["المستوى الثالث"],
    CharactersArea: ["يسمح بأضاءة مصابيح النيون"]
  },
  CC1: {
    productName: "CC1",
    Details: `محور تجاري رئيسى بمنطقة الإمتدادات الحديثة (النمط السائد)
                      أمثلة: طريق جدة ، طريق الملك خالد ، طريق المطار .هذه
                      الممرات ذات الطابع التجاري متنوعة في أحجام المساحات وأنواع
                      المباني وبالتالي فإن جميع أنواع اللوحات الممكنة كلها متاحة في
                      إطار القواعد.`,
    SignageTypes: ["لوحة محل", "لوحة المبنى", "لوحة مظلة منفصلة", "لوحة أسفل مظلة", "لوحة نافذة محل", "لوحة المداخل", "لوحة مظلة قابلة للطي", "لوحة عمودية جانبية"],
    ProductTypes: ["لوحة مسطحة", "الحروف ثلاثية الابعاد", "صناديق الإضاءة"],
    LightingTypes: ["اضاءة امامية", "اضاءة خلفية", "اضاءة جانبية", "اضاءة خارجية"],
    LightingLevels: ["المستوى الثاني"],
    CharactersArea: ["نطاق الوان واسع"],
  },
  CC2: {
    productName: "cc2",
    Details: `محور تجاري رئيسى بمنطقة وسط المدينة - (المنطقة الحيوية)
                      أمثلة: الطرق الدائرية ، طريق مكة ، محور الملك فهد المركزي ، طريق الملك عبدلله
                      ، طريق الملك سلمان.
                      هى محاور ذات أنشطة تجارية تمتد علي قطع أراضى ذات أحجام ومباني متنوعة
                      داخل مباني مختلفة ويسمح فيها بجميع أنواع اللوحات وفق القواعد..`,

    SignageTypes: ["لوحة محل", "لوحة المبنى", "لوحة مظلة منفصلة", "لوحة أسفل مظلة", "لوحة نافذة محل", "لوحة المداخل", "لوحة مظلة قابلة للطي", "لوحة عمودية جانبية"],
    ProductTypes: ["لوحة مسطحة", "الحروف ثلاثية الابعاد", "صناديق الإضاءة"],
    LightingTypes: ["اضاءة امامية", "اضاءة خلفية", "اضاءة جانبية", "اضاءة خارجية"],
    LightingLevels: ["المستوى الثالث"],
    CharactersArea: ["ألوان زاهية أو عالية التشبع", "يسمح بأضاءة مصابيح النيون"],
  },
  IA: {
    productName: "IA",
    Details: `الصناعة /المخازن
    أمثلة: الصناعات الثقيلة والصناعات الخفيفة والمخازن الكبيرة وأسواق الحيوانات
    تستخدم هذه المناطق عموماً لأغراض تجارية وإستخدامات خدمية، ولذا فإن اللوحات تخضع لمستوى تحكم ضعيف.`,

    SignageTypes: ["لوحة محل", "لوحة المبنى", "لوحة مظلة منفصلة", "لوحة نافذة محل", "لوحة المداخل", "لوحة مظلة قابلة للطي", "لوحة عمودية جانبية"],
    ProductTypes: ["لوحة مسطحة", "الحروف ثلاثية الابعاد", "صناديق الإضاءة"],
    LightingTypes: ["اضاءة امامية", "اضاءة خلفية", "اضاءة جانبية", "اضاءة خارجية"],
    LightingLevels: ["المستوى الثالث"],
    CharactersArea: [],
  },
  MC1: {
    productName: "MC1",
    Details: `محور رئيسي متعدد الإستخدامات بمناطق الإمتدادات الحديثة (النمط السائد)
    2 × مثال: الطرق الرئيسية التي تحيط بالمناطق و الأحياء السكنية (غالبًا ذات أبعاد 2 كم
    كم شبكة دوكسيادس).
    تتميز هذه المحاور الكبيرة بالتنوع في إستخدامات الأراضي. علما بأنه سيتم تغيير طابع
    المنطقة مع مشروع الرياض الخضراء إلى محاور رئيسية خضراء. ونظراً للتنوع في
    إستخدامات الأرض ، فإنه يُسمح بأنواع مختلفة من اللوحات بينما سيتم خفض بعض
    اللوحات بناءً على الكثافة الحضرية والنسيج.`,
    SignageTypes: ["لوحة محل", "لوحة المبنى", "لوحة مظلة منفصلة", "لوحة أسفل مظلة", "لوحة نافذة محل", "لوحة المداخل", "لوحة مظلة قابلة للطي", "لوحة عمودية جانبية", "الأعلام"],
    ProductTypes: ["لوحة مسطحة", "الحروف ثلاثية الابعاد", "صناديق الإضاءة"],
    LightingTypes: ["اضاءة امامية", "اضاءة خلفية", "اضاءة جانبية", "اضاءة خارجية"],
    LightingLevels: ["المستوى الثاني"],
    CharactersArea: ["نطاق الوان واسع"],
  },
  MC2: {
    productName: "MC2",
    Details: `محور رئيسي متعدد الإستخدمات بقلب المدينة (القلب ثقافي)
                        أمثلة: طريق البطحاء، طريق الملك فيصل.
                        تحتوي هذه المحاور على أنماط أراضى متعددة الإستخدامات، ذات أروقة وأنماط بناء مظللة، ونظراً
                        لتنوع إستخدامات الأراضي فإنه يُسمح بأنواع مختلفة من اللوحات، لكن سيتم تقليل حجم بعضها على
                        أساس الكثافة والنسيج في المناطق الحضرية، لا يمكن وضع لوحات البوابات على طول هذه المحاور،
                        .ولكن يمكن كبديل إستخدام اللوحات العمودية ذات التصميم البسيط`,

    SignageTypes: ["لوحة محل", "لوحة المبنى", "لوحة مظلة منفصلة", "لوحة أسفل مظلة", "لوحة نافذة محل", "لوحة مظلة قابلة للطي", "لوحة عمودية جانبية"],
    ProductTypes: ["لوحة مسطحة", "الحروف ثلاثية الابعاد"],
    LightingTypes: ["اضاءة خلفية", "اضاءة خارجية"],
    LightingLevels: ["المستوى الثاني"],
    CharactersArea: ["نطاق الوان واسع"],
  },
  MC3: {
    productName: "MC3",
    Details: `محور رئيسي متعدد الإستخدامات بمنطقة المركز التاريخي (المركز ذو الطابع النجدى)
    مثال: طريق المدينة المنورة.
    تحتوي هذه المحاور على إستعمالات مختلفة، ونظراً لتنوع الإستعمالات، تم تقليل حجم اللوحات بشكل
    كبير حسب الكثافة والنسيج العمراني، والهدف الأساسى من ذلك هو حماية العمارة والتراث الثقافي في
    المنطقة، لذلك لا يُسمح باللوحات في الطابق الأول كما أن حجم اللوحات قليل بشكل ملحوظ ويُسمح
    فقط بإستخدام اللوحات العمودية المستقلة.`,

    SignageTypes: ["لوحة محل", "لوحة المبنى", "لوحة مظلة منفصلة", "لوحة أسفل مظلة", "لوحة نافذة محل", "لوحة مظلة قابلة للطي", "لوحة عمودية جانبية"],
    ProductTypes: ["لوحة مسطحة", "الحروف ثلاثية الابعاد"],
    LightingTypes: ["اضاءة خلفية", "اضاءة خارجية"],
    LightingLevels: ["المستوى الاول"],
    CharactersArea: ["مواد عالية الجودة", "مواد طبيعية", `يرحب بأنماط مدينة نجد
                                                                        التصميمية و الزخارف
                                                                        العربية التاريخية`]
  },
  MC4: {
    productName: "MC4",
    Details: `محور صغير متعدد الإستخدامات بمنطقة الإمتدادات الحديثة (النمط السائد)
                          2 كم شبكة دوكسيادس - المفروكة) × مثال: شوارع رئيسية تعبر الأحياء السكنية (غالباً ما تكون ذات بعد 2 كم
                      تحتوى هذه المحاور على أشكالا مختلفة من إستخدامات الأراضي، لذلك تم إستخدام أنواع مختلفة من اللوحات و التي
                      قد يتم تقليل حجمها بشكل كبير وفقاً للكثافة والنسيج الحضري، عادةً ما تكون المباني على طول المحور ذات إرتفاعات
                      منخفضة وتشكل واجهة متصلة، ولذلك لا يُسمح بأي لوحات ثلاثية الأبعاد فوق الطابق الأول، ويمكن تقليل حجم
                      اللوحات بشكل كبير ويسمح بإستخدام اللوحة العمودية فقط عند الضرورة العملية، ومن الأفضل تجنبها.`,
    SignageTypes: ["لوحة محل", "لوحة المبنى", "لوحة مظلة منفصلة", "لوحة أسفل مظلة", "لوحة نافذة محل", "لوحة المداخل", "لوحة مظلة قابلة للطي", "لوحة عمودية جانبية"],
    ProductTypes: ["لوحة مسطحة", "الحروف ثلاثية الابعاد", "صناديق الإضاءة"],
    LightingTypes: ["اضاءة امامية", "اضاءة خلفية", "اضاءة جانبية", "اضاءة خارجية"],
    LightingLevels: ["المستوى الثاني"],
    CharactersArea: ["نطاق الوان واسع"]
  },
  RA: {
    productName: "RA",
    Details: `المناطق السكنية
    أمثلة: فيلا ، دوبلكس ، شقق ، إلخ.
    الأنشطة التجارية / المتاجر عادة ليست مسموح بها في المناطق السكنية وفق قوانين التخطيط العمراني فى مدينة
    الرياض، وفي حالة وجود استثناء فإنه يُسمح بعدد قليل جداً من أنواع اللوحات والهدف العام من ذلك هو ضمان بيئة
    هادئة في المناطق السكنية عن طريق تقليل اللوحات إلى أقل عدد ممكن وكذلك التحكم الصارم في شدة الإضائهم.`,

    SignageTypes: ["لوحة محل", "لوحة المداخل", "لوحة عمودية جانبية"],
    ProductTypes: ["لوحة مسطحة", "الحروف ثلاثية الابعاد"],
    LightingTypes: ["اضاءة خلفية", "اضاءة خارجية"],
    LightingLevels: ["المستوى الاول"],
    CharactersArea: []
  },
  SA: {
    productName: "SA",
    Details: `منطقة الخدمات
    أمثلة: الخدمات العامة: المدارس والجامعات ومراكز الشرطة والإسعاف والمساجد إلخ.
    بشكل عام فإنه من المفترض أن تكون المؤسسات والسلطات الحكومية لديها بالفعل نظام اللوحات للمنشأت الخاصة
    بهم، والتي يتم إستخدامها لجميع منشآتهم ومرافقهم بالرياض أو حتى على مستوى المملكة كلها، وبخلاف ذلك فإن
    الدليل يسعى إلى إنشاء تصميم متسق للمؤسسات العامة بتطبيق جميع القواعد العامة للدليل، يُسمح لجميع
    المؤسسات الحكومية بإستخدام الأعلام.`,

    SignageTypes: ["لوحة محل", "لوحة المبنى", "لوحة مظلة منفصلة", "لوحة نافذة محل", "لوحة المداخل", "لوحة عمودية جانبية"],
    ProductTypes: ["لوحة مسطحة", "الحروف ثلاثية الابعاد"],
    LightingTypes: ["اضاءة امامية", "اضاءة خلفية", "اضاءة خارجية"],
    LightingLevels: ["المستوى الثاني"],
    CharactersArea: [],
  }
}
